#include <iostream>

int main()
{
    //스코프 or 지역 : 함수의 시작과 끝 사이를 일컫는 말
    
    //지역에 선언된 메모리

    //10; <= 고정된 숫자는 상수
    //열거형
    //정수형
    //실수형
    //논리형
    //사용자 정의 자료형

    //표현하기 위한 자료형  이름
    //ex)
    //자료형           이름          연산자             값
        int         Att                 =               10;
        int         Def                 =               5;
        int         MonsterHp           =               8;
    
    //자료형의 의미
    // 1. byte 크기
    // 2. 처리 형태

    //이름의 의미
    // 1. 위치 <= 내프로그램의 시작위치에서 n Byte 떨어진 곳에 만듬 : 상대적 위치
        //주소값으로 치환 <= Ram에서의 물리적 위치

    //지역에 선언된 변수 : 지역 변수
}